{"pages":[{"title":"关于","text":"这是一个博客，建于2018年的开始。 它的域名花了我四十五块钱，这是我吃一顿麻辣香锅的钱，虽然不是很多，但好歹也是一顿饭钱，更何况本人今年发誓要戒掉香锅，所以更得好好对待。 由于本人还戒掉了矫情，别的就不多说了，诸位看官随便看看吧。","link":"/about/index.html"},{"title":"归档","text":"","link":"/archive/index.html"}],"posts":[{"title":"1998大败局（一）","text":"1998年3月，秦池酒业的姬长孔黯然离开了秦池，而就在三年前，这位失意者却在北京用足以把豪华的梅地亚中心淹到半腰的三万吨白酒的价格——六千六百六十六万，一举夺下了第二届中央电视台黄金段位广告招标大会的标王，震惊了全国。那时候的姬长孔意气风发，在第二年的招标会上不仅说出了“1995年，我们每天向中央电视台开进一辆桑塔纳，开出的是一辆豪华奥迪。今年，我们每天要开进一辆豪华奔驰，争取开出一辆加长林肯。”这样的豪语，更是用自己的手机号3212118作为投标金额，以高出第二名足足一亿元的巨大优势蝉联了第三届的标王并在当年拿下了白酒行业唯一的绿色食品认证。彼时的秦池，是当之无愧的酒厂老大，也是新闻媒体聚焦下的宠儿。 可就在秦池酒业刚刚景气起来的第四个年头，《经济参考报》的一则关于秦池白酒用川酒勾兑的系列新闻报道就将这位看起来不可一世的巨人给狠狠地踹进了深渊。尽管秦池的广告还是依旧的铺天盖地，但在媒体的一片批评声中，不擅常应对舆论的姬长孔悲哀地发现：之前加大马力生产的积压了足足200车皮的白酒，在整整一年的卖力吆喝下，仅仅卖出了一半，曾经连轴转的多条生产线，也只剩下了四五条，过去围在他身边说尽了甜言蜜语的新闻媒体们，也纷纷露出了落井下石的獠牙。这位退伍军人出身的明星厂长扭亏为盈过两家县里的公司，却在第三次担任救火队长时，吃到了一颗甜蜜而又恶毒的果子，媒体给了他和酒厂一个灿烂的瞬间，转眼又让他们说起了往事如烟。 落魄的姬长孔临走时说了两句话，一句对秦池：“秦池是一个瘸子。”，一句对自己：“国家得大头，地方得中头，企业得小头，个人得一身病。”两句话算是对他自己在秦池五年经历的总结，但有意无意的，他始终没有对造就他而又毁灭他的媒体们评价上几句。不过在十年后的2008年，当记者再次找上门时，已经得了“媒体恐惧症”的秦池酒厂和姬长孔，均拒绝了采访。 在ODM模式风靡的今天，秦池用川酒勾兑的做法其实并不能算得上是欺骗消费者，反而是企业先进的表现。但对于当时的秦池、媒体和消费者而言，阐述、明白或接受这个概念都显得极其困难，缺乏公关能力的姬长孔和酒厂在舆论的巨大反差当中显然也已经慌了手脚，跌落神坛便成了一个板上钉钉的事实。作为一家暴发型企业，秦池用它的崛起与崩殂，展示了后来者一个代价极大的教训：成也造名，败也造名。 1998年的11月，已经被调到北京某部委的姬长孔又一次来到了梅地亚中心的门前，在前几年的标会上，他一直都是聚光灯的中心，而现在，他却因为没有邀请函而被门卫客气的挡在了门外。 不过过一会他就能见到新一届的标王胡志标志得意满的走出大门——他掌控的爱多，似乎正在经历一场有关于青春期的错觉，等待这位后来者的，也会是一个从万丈豪情到身陷囹圄的悲喜故事。","link":"/2018/02/10/1998大败局（一）/"},{"title":"Python学习笔记（一）：基础","text":"数据类型和变量整数Python可以处理任意大小整数，在计算机中，有时会使用十六进制表示。 浮点数浮点数的小数点位置可变，常用科学计数法表示，浮点数运算会有误差。 字符串以 ‘ 或 “ 括起来的任意文本，如果 ’ 本身是一个字符，可用 “ “ 括起来。 此外，还有 \\ 作为转义字符，值得注意的是 \\ 表示 \\，如果需要转义的比较多，那可以使用 r’ ‘。很多行内容的话，使用 ‘’’ … ‘’’’。 布尔值只有False和True，注意大写，布尔值可以用and、or和not运算。 空值用None表示，不是0。 变量在Python中，使用动态语言，可以把不同类型赋值给一个变量。 常量通常用全部大写的变量名表示常量。 在Python中，有两种除法，一种是 / ，所得结果必为浮点数，另一种是 // ，所得必为整数（取结果的整数部分）。此外， % 可以用来取余数。 使用list和tuplelistlist是一种有序集合，可以随时添加和删除。 123&gt;&gt;&gt;classmates = [&apos;a&apos;, &apos;b&apos;, &apos;c&apos;]&gt;&gt;&gt;classmates[&apos;a&apos;,&apos;b&apos;,&apos;c&apos;] classmates就是一个list，用len(）函数可以获得个数。 12&gt;&gt;&gt;len(classmates)3 我们可以用索引来记录元素位置，索引从0开始，-1代表着最后一个元素。 我们可以在list的末尾加元素，用 classmates.append(‘XX’)； 也可以插入，用classmates.insert(1,’XX’)； 还可以删除，用pop()方法，默认去除末尾，也可以用pop(i)方法，i代表位置； 替换成别的元素也比较简单，直接重新赋值即可。 list里的数据类型可以不同，还可以包含另一个list。 tupletuple与list类似，但不能修改。 12classmates=(&apos;a&apos;,&apos;b&apos;,&apos;c&apos;)t=(1,2) 在定义的时候，元素必须被确定。 只有一个元素的时候，必须加 , ，避免歧义。 1t=(1,) 当tuple含有一个list元素时，list中的元素可变。 条件判断12345678if 条件判断1： 执行1elif 条件判断2： 执行2elif 条件判断3： 执行3else： 执行4 123456n = input(&apos;number: &apos;)//括号内显示num = int(n) //input()返回类型为str，需转为整数if num &gt; 100: print(&apos;XX&apos;)else: print(&apos;X&apos;) 循环for x in … ：把每个元素代入变量x然后执行缩进块语句 1234sum = 0for x in range(101): //range(101)为从0开始小于101的数 sum = sum + xprint(sum) 1234567n = 1while n &lt;= 100 ： if n &gt; 10: break print(n) n = n + 1print(&apos;END&apos;) 123456n = 0while n &lt; 10: n = n + 1 if n % 2 = 0: continue print(n) 使用dict和setdict为词典： 123&gt;&gt;&gt; d = [&apos;a&apos;:100, &apos;b&apos;:95]&gt;&gt;&gt; d[&apos;a&apos;]100 多次对一个key放入value，后面的值会把前面的值冲掉。 可以通过in来判断key是否存在或者通过get()方法,例如d.get(‘a’)，还可以指定不存在时返回的value，如d.get(‘a’, -1)。 去除一个key，可以用pop(key)，对应value也会删除。 与list相比，查找、插入速度快，但需要占用大量内存，浪费，相当于用空间换时间。 key是不可变的，所以不许用可变的list等来作为key。 set与dict类似，一组key集合，但不储存value，key不能重复，有重复会合并。 创建set需要提供一个list作为输入集合： 1&gt;&gt;&gt; s = set([1,2,3]) 输出会有{1,2,3}，注意显示顺序并不代表set有序。 add(key)添加元素，remove(key)删除元素。 两个sey可以做交集、并集操作。 set也不可以放入可变对象","link":"/2018/01/06/Python学习笔记（一）：基础/"},{"title":"Python学习笔记（二）：函数","text":"调用函数通过help()来查看函数信息 库中有数据类型转换函数 12345678910&gt;&gt;&gt; int(&apos;123&apos;)123&gt;&gt;&gt; int(12.3)12&gt;&gt;&gt; str(1.2)&apos;1.2&apos;&gt;&gt;&gt; bool(1)True&gt;&gt;&gt; bool(&apos;&apos;)False 函数名可以赋予到一个变量 12&gt;&gt;&gt; a = abs //注意没括号&gt;&gt;&gt; a(-1) 定义函数定义一个函数使用def语句，依次写出函数名、 括号、括号中参数和冒号， 然后在缩进块中编写函数体，用return返回。 12345def my_abs(x): if x &gt;= 0: return x else: return -x 在Python交互环境中定义函数时，会出现…提示。定义结束按两次回车跳出。 如果将函数保存为文件，在当前目录下启动解释器，可用from XXX（文件名称)import xxx（函数名） 来导入函数。 空函数可用pass： 12def nop(): pass 函数返回值为一个tuple 12x, y = move(100, 100, 60, math.pi / 6)r = move(100, 100, 60, math.pi / 6) 打印出来一样 函数的参数理解位置参数，一一对应 默认参数： 1def p(x, n = 1): 用p(4,3)时，n = 3 设置默认参数时，必选参数在前，默认参数灾后 默认参数削减工作量 多个默认参数时，按顺序，也可以不按顺序，如my_aa(1, 2, n = 4) 默认参数必须指向不变对象 123def add_e(L=[]): L.append(&apos;E&apos;) return L 改成： 12345def add_e(L=None): if L is None: L = [] L.append(&apos;E&apos;) return L 可变参数是传入的参数个数可变 参数可以为list，调用时要组出一个来。 1234567def cal(num): sum = 0 for n in num: sum = n + sum return sum&gt;&gt;&gt; cal([1,2,3])&gt;&gt;&gt; cal((1,2,3)) 为了方便，我们将参数变为可变参数： 1234567def cal(*num): sum = 0 for n in num: sum = n + sum return sum&gt;&gt;&gt; cal(1,2)&gt;&gt;&gt; cal() 这时候，调用时可以传入任意个参数 如果已经有一个list或tuole，Python允许在list或tuple前加一个*,把元素变成可变参数传进去。 12&gt;&gt;&gt; nums = [1,2,3]&gt;&gt;&gt; cal(*nums) 关键字参数允许传入任意个含参数名的参数，在函数中自动组装成dict。可以扩展函数功能。 123456789def person(name,age,**kw): print(&apos;name: &apos;,name,&apos;age: &apos;,age,&apos;something: &apos;,kw)&gt;&gt;&gt; person(&apos;Mi&apos;, 30)name: Mi age: 30 something: {}&gt;&gt;&gt; person(&apos;lee&apos;, 20, city=&apos;guang&apos;)name: lee age: 20 something: {&apos;city&apos;:&apos;guang&apos;}&gt;&gt;&gt; person(&apos;ce&apos;, 21, city=&apos;ms&apos;,sex=&apos;woman&apos;)name: ce age: 21 something: {&apos;city&apos;:&apos;ms&apos;,&apos;sex&apos;:&apos;woman&apos;} 123&gt;&gt;&gt; extra = {&apos;city&apos;:&apos;ms&apos;,&apos;sex&apos;:&apos;woman&apos;}&gt;&gt;&gt; person(&apos;ce&apos;, 21, **extra)name: ce age: 21 something: {&apos;city&apos;:&apos;ms&apos;,&apos;sex&apos;:&apos;woman&apos;} 我们可以在内部检查： 12345def person(name, age, **kw): if &apos;city&apos; in kw: pass if &apos;job&apos; in kw: pass 我们还可以限制关键字参数的名字，运用分隔符* 1234def person(name, age, *, city, job): print(name, age, city, job)&gt;&gt;&gt; person(&apos;Jack&apos;, 22, city = &apos;ms&apos;, job = &apos;s&apos;):Jack 24 ms s 如果函数定义中已经有了一个可变参数，后面跟着的命名关键字参数不再需要*。 12def person(name,age,*args,city,job): print(name,age,args,city,job) 命名关键字必须传入参数名 同样，命名关键字参数可以有默认值。 参数定义的顺序：必选参数、默认参数、可变参数、命名关键字参数和关键字参数。 递归函数递归函数调用自身1234def fac(n): if n==1: return 1 return n*fact(n-1) 使用递归注意防止栈溢出，可采用尾递归（循环就是尾递归的一种）。 1234567def fact(n): return fact_iter(n, 1)def fact_iter(num, product): if num == 1： return product return fact_iter(num - 1, num * product) 可以看到，num - 1 和 num * product 在函数调用前会被计算，不影响函数调用。 python解释器没有针对尾递归做优化，任何递归函数都存在栈溢出问题。","link":"/2018/01/06/Python学习笔记（二）：函数/"},{"title":"Python学习笔记（二）：高级特性","text":"在Python中，为了提高效率，我们需要掌握一些高级特性。 切片故名思议，即为截取。 123&gt;&gt;&gt; L = [&apos;a&apos;, &apos;b&apos;, &apos;c&apos;]&gt;&gt;&gt; L[0:2][&apos;a&apos;, &apos;b&apos;] L[0:2]指的是索引从0开始，在2之前结束。既包括L[0]、L[1]。 可以从负数到零：L[-2:]其中0可以省略，注意这不是循环，只能负数到零。索引为L[-2]、L[-1]。 迭代如果给定一个list或tuple，能通过for循环来遍历这个list或tuple，这种为迭代。在Python中，迭代通过for…in来完成。 只要是可迭代对象，无论有没有下标，都可以迭代。 12345678910111213141516171819&gt;&gt;&gt; d = {&apos;a&apos;:1, &apos;b&apos;:2, &apos;c&apos;:3}&gt;&gt;&gt; for key in d:... print(key)...acb ///dict的存储不排序，迭代顺序不一样&gt;&gt;&gt; for value in d.values():... print(value)...123&gt;&gt;&gt; for k, v in d.items():... print(k,v)...a 1b 2c 3 字符串也可以迭代 123456&gt;&gt;&gt; for cl in &apos;abc&apos;:... print(cl)...abc 判断是否为迭代对象可以 12345&gt;&gt;&gt; from collections import Iterable&gt;&gt;&gt; isinstance(&apos;abc&apos;, Iterable)True&gt;&gt;&gt; isinstance(123, Iterable)False 要想对list实现类似java的下标循环，enumerate函数可以把一个list变成索引-元素对。这样可以在循环中同时迭代索引和元素本身。 123456&gt;&gt;&gt; for i, value in enumerate([&apos;a&apos;, &apos;b&apos;, &apos;c&apos;]):... print(, value)...0 a1 b2 c 同时引用两个变量比较常见： 12345for x, y in [(1,1), (2,3)]:... print(x,y)...1 12 3 列表生成式列表生成式可以创建list 12&gt;&gt;&gt; list(range(1,5))[1,2,3,4] 可见可以生成从1到不到5的数 如果想生成[1x1, 2x2, 3x3]，可以： 12&gt;&gt;&gt; [x*x for x in range(1,4)][1, 4, 9] 还可以在for循环后面加if判断 12&gt;&gt;&gt; [x*x for x in range(1, 5) if x % 2 == 0][4, 16] 还可以使用两层循环，生成全排列： 12&gt;&gt;&gt; [m + n for m in &apos;AB&apos; for n in &apos;CD&apos;][&apos;AC&apos;, &apos;AD&apos;, &apos;BC&apos;, &apos;BD&apos;] 列表生成式可以用两个变量来生成list 123&gt;&gt;&gt; d = {&apos;a&apos;:1, &apos;b&apos;:2}&gt;&gt;&gt; [k + &apos;=&apos; + str(v) for k, v in d.items()][&apos;a=1&apos;, &apos;b=2&apos;] 生成器一边循环一边计算，为生成器 创建一个generator，只需将列表生成式中的[]变成()即可 12345678910111213141516&gt;&gt;&gt; g = (x*x for x in range(10))&gt;&gt;&gt; g&lt;generator object &lt;genexpr&gt; at 0x1022ef630&gt;&gt;&gt;&gt; for n in g:... print(n)...0149162536496481 1234567def fib(max): n, a, b = 0, 0, 1 while n &lt; max: print(b) a, b = b, a + b n = n+ 1 return &apos;done&apos;//最后输出&apos;done&apos; 改为： 1234567def fib(max): n, a, b = 0, 0, 1 while n &lt; max: yield b a, b = b, a + b n = n + 1 return &apos;done&apos; 迭代器可以被next()调用并不断返回下一个值的对象就是迭代器（Iterator），注意，这和可迭代对象不一样。 可以用isinstance()来判断是否为Iterator。 生成器都是Iterator，但list、dict、str虽是Iterable，却不是Iterator，能用iter()函数变成。 12&gt;&gt;&gt; isinstance(iter([]), Iterator)True Iterator的计算是惰性的，只有需要时才会计算。","link":"/2018/01/07/Python学习笔记（二）：高级特性/"},{"title":"《结网》笔记（一）：产品经理","text":"互联网产品经理定义通常是负责对现有互联网产品进行管理及营销的人员，也负责开发新产品。 个人补充：产品经理是发现需求与定义需求的人员 工作内容战略性工作：跨越整个生命周期 为产品建立长期战略布局 发现新的产品机会 为产品的演变与改进提供建议 阶段性工作：明确的起始时间 参与新产品开发 参与年度商业计划的制定 参与或开展营销活动 预测竞争对手行动并制定应对方案 更新产品并进行用户教育 降低产品成本 重新规划产品线 日常性工作：按日执行 收集分析竞品情报 协调开发、运营、客服、销售等资源保证工作 执行商业计划 产品经理应以创造用户价值为使命 个人意见 战略性工作是产品专家需要考虑的，产品新人更多的是在做二、三阶段的工作 收集分析竞品情报易在工作日最后一天进行整理，方便为每周计划制定目标 需注意处理好日常性工作的安排问题，各种突发情况会打乱安排","link":"/2018/01/08/《结网》笔记（一）：产品经理/"},{"title":"《论犯罪与刑罚》读书笔记","text":"刑罚的起源与结论物质需求与供给不足产生矛盾，人们为了平安享受自由而甘愿牺牲一部分自由。被牺牲的自由总和起来，就形成了一个国家，由政府来对这一部分自由进行保存和管理。 为了保卫它不受私人侵犯（有些人想既夺回自己的自由又霸占别人的自由），就需要采取易感触的力量来阻止那些人。这种力量就是对触犯法律者所规定的刑罚。之所以让其易感触，是因为如果不直接触及器官又不经常映于头脑中来抗衡私欲，那就无法长久地约束物质刺激诱发的欲望。 对自由不受侵犯的需要迫使人们割让自己的一部分自由，但毫无疑问，每个人都希望交给政府的自由能少一些，只要足以让别人保护自己即可。因此，这一份份最少量自由形成了惩罚权，一切额外的东西都意味着不公正。 所以，我们得出了结论： 只有法律才能为犯罪规定刑罚，只有代表根据社会契约联合起来的整个社会的立法者才拥有这一权威。任何人（包括司法者）都不能自命公正地对其他人施以刑罚。任何一个司法官都不得以任何借口增加对犯罪公民的既定刑罚。 代表社会的立法者只能制定约束一切人的普遍法律而不能判定有无违法，需要有判定事实真相的第三方也即司法官员出现，他需要对具体事实做出单纯的肯定或否定。 严酷的刑罚违背了公正和社会契约的本质。 刑事法官没有解释刑事法律的权力，因为他们不是立法者法官对任何案件应该进行三段论式的逻辑推理：大前提是一般法律，小前提是行为是否符合法律，结论是自由或者刑罚。法律的含混性如果说对法律进行解释是一个弊端，那么，使人不得不进行解释的法律含混性本身是另一个弊端。 人类传统的可靠性和确定性，会随着逐渐远离其起源而削弱。 关于逮捕监禁是一种特殊的刑罚，它需要在宣布犯罪之前执行。但是，它的基本点是只有法律才能确定一个人在什么情况下应受刑罚。逮捕某个公民的证据应该由法律决定而不是由法官来决定。 一个被控犯罪的人，经监禁而获释后，不应背上什么耻辱的名声。 犯罪嫌疑和审判形式衡量犯罪嫌疑的可靠性时，需要以下公式： 如果某事的各个证据是互相依赖的，即嫌疑只能互相证明，那，援引的证据越多，该事件的或然性就越小。 证实犯罪的证据可分为完全的和不完全的，排除了无罪可能性的证据为完全，只要有一个，就足以定罪。反之则为不完全的，这种证据要变成完全的，需要足够的数量将其串联起来。 由于证据在道德上的确实性要比明确地加以界定容易，所以优秀的法律应该为主要法官配置一些随机产生而非选举产生的陪审官，在这种情况下，根据感情作出判断的无知要优于根据见解作出判断的学识。 每个人都应由地位相等的人来裁判以防止煽动平等的态度作恶。当犯罪侵害的是第三者时，陪审官就应该是一半与罪犯地位相等的人一半是与受害者地位同等的人。 罪犯可以在一定程度上排除他所信不过的人，审判应当公开，证据应当公开，以便使舆论能够约束强力和欲望。 证人恰如其分地确定证人和犯罪证据的可信程度是一切优秀立法的显著特点。 一切有理智的人，思想具有一定连贯性，其感觉同其他人相一致的人，都可以作为证人。衡量这种人的可信度的尺度仅在于说不说真话同他的利害关系。 已决犯的口供并不应使用“民事死亡人”概念，真相不应该屈从于审判形势，只要已决犯的口供达不到阻止司法进程的地步，就应该利用其作为自己或他人的辩解。 进行审判时，手续和仪式是必须的，这可以使司法者无从随意行事，也可以是民众信服。当然，如果手续和仪式要想不成为灾难，那法律就绝不能把它规定得有损于揭示真相。 证人的可信度应随着他与罪犯的关系（亲近或厌恶）进度降低。 一个以上的证人是必需的。 犯罪越残酷或情节越离奇，证人的可信度就越低。同样，当证人是属于非主流团体的一员，该人的可信程度成倍降低，因为这种人不仅包含本人的欲望，还包含别人的欲望， 当有些证人将别人讲的话指为犯罪时，证人可信度基本为零。 秘密控告秘密控告是不正常的现象，公开控告才比较适合于共和国，在那里，公共福利将成为公民的第一愿望。每个政府，都应该对诬陷者处以反坐的刑罚。 提示性询问、口供法律禁止提示性讯问，当应就犯罪情形进行泛指的询问时，要进行特指的询问，即讯问直接针对犯罪，提示罪犯做出直接回答。 在审查中拒不回答提问的人，应被处以法律所确定的刑罚。当其他证据肯定被告人犯有罪行以致于供任与否都无关紧要时，上述刑罚也就不需要了。 宣誓宣誓并没有用，因为它会导致人的自然感情同法律之间的矛盾。经验告诉我们，宣誓从来没有能使任何罪犯讲出真话。 因此，一切违背人的自然感情的法律都是无益的，是注定会被毁灭的。 刑讯在法官判决之前，只要还不能断定他已经侵犯了给予他公共保护的契约，社会就不能取消对他的公共保护。 每一个人的气质和算计都随着本人体质和感觉的差异而不同，刑讯的结局体现的是个人气质和算计的情况而不是真相。 程序和时效对犯罪进行查证并对其确定性做出计算后，需要为烦人提供一定的时间和适当的方式为自己辩护。但我们知道，刑罚的及时性是直至犯罪的重要手段之一，为了不影响刑罚的及时性，给犯人的辩护时间应是短暂的。 因此我们只能根据具体的法制和一个社会的具体环境来规定确切的时间。如果一个国家宽和刑罚已经显示了优越性的话，法律根据犯罪的程度来修改时效时间和查证时间，是自我监禁和自行流放成为刑罚的一部分将有助于用少数宽和的刑罚处置大量犯罪。 但由于犯罪的可能性同凶残性成反比例，因而，查证时间和时效时间并不能完全根据犯罪的凶残性而延长。审查的时间应该缩短，时效","link":"/2018/01/11/《论犯罪与刑罚》读书笔记/"},{"title":"互金笔记（一）：网络银行","text":"概况网络银行的狭义定义是线下渠道向线上渠道的延伸，它不是新的银行形式而是传统银行业务的网络渠道。广义定义是依托互联网展开业务的银行服务形态，当然并没有改变其银行业务的本质。 按组织形式分类分为：传统银行的网上银行服务（作为一个部门和业务渠道出现）、传统银行或金融集团的子银行（以独立法人实体形式出现）与独立的网络银行（不隶属于任何传统银行或金融集团，几乎所有业务都在网上进行）。 按经营特点可分类为：传统转型的银行（本身有一定传统业务基础，利用互联网进行新的市场布局/战略转型）与其他领域切入或从零开始的新兴独立网络银行。其中后者可分为综合化的全能网络银行和专业化网络银行（主要依托电子商务平台或证券投资平台）。 发展在国外，网络银行的演进规律为： 新兴的网络银行不会冲击传统格局反而促进转型 成功者往往是转型的传统银行/有母公司资源支持的独立银行 品牌认知度不高、管理不成熟、规模小的网络银行大都被淘汰 而在我国，网络银行的发展特点是与传统银行相互促进，协同发展。这其中的优秀代表有工行融e行（业务少而精，成立之初仅有开账户、存款、投资、交易四大功能）、民生直销银行（互联网思维运作，注重用户体验）和平安橙子银行（主打年轻人口号+轻资产运作）。 模式主要有两大业务模式——信贷业务模式和负债业务模式。 信贷业务模式讲究大数据对信贷业务的流程再造，依托电子商务，基于大数据挖掘，预先授信，自动审批，大大提高了信贷效率并提升了用户体验。但这种模式具有缺乏抵押品、催收难度较大、风险化解和处置难等问题。 负债业务模式主要围绕降低成本和增进体验这两个核心要素来做，通过省去了物理网点的人工和租金成本、突破了传统银行的地域限制，网络银行获得了巨大的优势。目前国内网络银行的负债业务主要以个人理财为核心诉求。 风险与传统银行相比，网络银行存在着更多、更大的风险： 信用风险：无实地调查、无不动产抵押和异地客户贷后管理难 市场风险：与传统银行并无太大区别，以利率风险为主 流动风险：存款稳定性差、公众信任度低、初期运营成本高 操作风险：减少了人工风险但产生了技术、认证风险 挑战与对策网络银行面临的挑战有并不符合以面对面见证为基础的管理制度、传统的分业分属地监管模式和原有的非现场监控体系。此外，存款准备金、存贷比随着效率提高需要修改，而重点监管目标也需要由业务风险转为技术、声誉风险。 为了应对这些挑战，国外的通常做法是在与传统银行一致性监管的基础上针对业务特点增加监管，国内则应用人脸识别等技术审核用户真实身份来降低认证风险。目前国家的方向是在监管规则和监管框架的设计上坚持开放、包容的理念，坚持监管公平性防止监管套利，建立适合的现场、非现场检查体系，鼓励银行基于账户风险等级实现差别化认证要求，科学设置监管指标和规则。","link":"/2018/01/03/互金笔记（一）：网络银行/"},{"title":"圣诞与苹果","text":"在美国有个很有意思的事情，那就是很多商家在圣诞节不能打着“Merry Christmas”的牌子，你要是想来点节日气氛，那得说“Happy Holidays”。前者有宗教传播的嫌疑，后者才能算是21世纪的政治正确。所以在高举反政治正确的特朗普上台后的首个圣诞节，在白宫贺卡的封面，终于有了“Merry Christmas”这十四个大字，可能总统觉得不太过瘾，又在里面重新印了一遍，狠狠的过了一把信守承诺的瘾。 “Each one of us is a child of God. ”特朗普在圣诞夜前夕如是说。不过他大概忘了，就在几个世纪前，圣诞节在美国还是非法节日，当时国内的信仰主力是清教徒，这伙道学先生只看《圣经》不问传统，不仅从地中海的气候特性推断出耶稣诞生的时候不是十二月，还把圣诞节归为那些异教徒的诡计。可以说是与其有着不共戴天的大恨。 万万没想到的是，过了也就两百来年，圣诞节就从一个纯宗教性的节日变成了全球民众的狂欢，就连昔日最该反对过圣诞节的清教徒立国的国家，到了十二月份也得上几部歌颂圣诞的全家欢电影蹭蹭热点。而在这期间，无神论者、天主教徒、清教徒以及乱入的犹太人（他们的光明节和圣诞节悲剧性的重合了）等相关势力不知发生了多少次悲喜交加的冤家故事，这其中，不知又要有多少次破口大骂与无奈妥协。 一直到现在，圣诞是什么、过不过圣诞以及怎么过圣诞都是一个严肃的话题，就像我们是谁、我们从何出来、我们到哪去一样，在十二月末开始牵绕着很多吃饱了没事干的人（比如本人）的心。就连最不该有这种烦恼的天主教徒，也得抗议下政府不让他们宣传怎么过圣诞节的压迫以及酝酿点世风日下的忧心忡忡。 有趣的是，在信仰无神论的我国，也同样有着关于圣诞终极问题的争论。有人喊这腐蚀了自古以来的传统文化，有人讲这不符合赖以立国的意识形态，还有人嚷嚷着这是西方敌对势力蓄意已久的阴谋（你倒不如说这是我们山东人为了卖苹果而编造的谎言来得好）。总之在大家都开开心心的说着洋鬼子都不太敢公开说的“Merry Christmas”的时候，总得有点反对意见来证明这件事是真实发生的（这挺符合常理）。 我未成年的时候不怎么过圣诞节，甚至连平安夜是怎么一回事都不知道。初中的时候有几位女同学在那四处讨要硬币说是要跟苹果放在一块当做礼物送出去的时候有点懵，想了半天都想不到为什么西方人会有这种C朝A要硬币送给B的传统，更何况这ABC里面总有一个异性和两个同性，故事本足够曲折了，局中人还要往里面勾上点芡，生怕不够生动。 送硬币的传统我不知道是单我们那有还是全国都这样，但平安夜苹果的大卖是真的。其火爆程度可以从我妈都要塞两个印着“平安”两个字的苹果给我时看出，有些无奈的是苹果是我最不喜欢吃的水果，而我妈打那之后每逢我出远门都要偷偷塞两个苹果在包里。我想当初给苹果取名的人一定是个优秀的产品经理，他早已料到百姓们对于平安的渴望和花小钱办心安的传统，巧妙的运用了一次“增长黑客”。 就像是平安夜促进了山东烟台的GDP一样，圣诞节的存在也推动了我国商业的蓬勃发展。不管是提供了全球近六成圣诞商品的浙江义乌，还是遍布于全国各地的商场和酒店，都从其中获益匪浅。更别提无聊了快两个月的情侣和单身汉们，终于又有了一次可以在朋友圈自然展现自己感情状况的机会。 所以我们就不难理解为什么当抵制圣诞的口号一出就遭到了众人抵制了，别人好不容易有个节日能乐呵乐呵，干嘛非要扯这些乱七八糟的呢。没几个人会过了圣诞就去信基督，你看圣心大教堂做个弥撒，来看热闹等自拍的学生和来凑热闹等拍片子的老法师们能有几个会放下相机，立地忏悔呢？ 要我说，咱们要是想抵抗圣诞节，国家就得多立几个能放假的节假日，学究们也得多从古籍中挖掘出或编造出点适合年轻人玩的传统节日项目。你看就像电商界，没有在那洋鬼子的黑色星期五面前低头，反而是直接搞了什么双十一、618、双十二、新年大促，甚至硬生生的在国外也打拼出了一片市场，这才是真正的“文化输出”与“道路自信”。节假日这块阵地,我们不占领,敌人就会占领，这话一点也没毛病。 其实把日晷拨回到四世纪初，十二月二十五号还是罗马主流教派密特拉教供奉太阳神的生日，基督教比较鸡贼，把异教徒的节日拿过来当做了耶稣诞生日，从这一点我们又可以看出，早起基督教会的领导也一定是个优秀的产品经理。 嗯，人人都是产品经理。","link":"/2018/01/03/圣诞与苹果/"},{"title":"新春拜年故事","text":"过年了，按照鲁中地区的风俗，是要走街串巷，回村里挨家挨户磕头的。 挨家挨户自然不是每家每户，通常得是本家，还得是同宗同族的长辈们。磕头也自然不是向着活人磕，一般都是长辈或长子家里供着牌位，一伙人呼啦啦地跪下挨个叩首。所以族里人丁越稀薄，子孙就能越快例行完公事。 一大早，挨着近的几个族内知己就要聚在一块开始筹划着今天的路线了。他们面临的是一个NP-hard问题，貌似一时半会算不出最优解，就索性先用上贪心算法，等人多了，就再拍上动态规划。用人话来说，那就是走一步看一步了。 队伍是可以扩充的，因为村里路不多，所以总能碰上熟人。倘若离家久了，再次相见时未免生疏，若是生疏到一定地步了，就不晓得该是叫舅还是叫叔了。 故两拨人相见时，人群中往往会发出“嚯”、“嗬”声。这类形容愉悦与赞叹的词常伴随着两张嘴的不自然展开和亲切的握手礼而出现，以此来掩饰双方之间并不熟悉的事实。在一阵语气助词之后，紧跟而来的便是“家来了啊（回来了）？”这样一句显而易见又十分客气的陈述疑问句。当得到明确的答复之后，就会对其进行扩展延伸，比如“二十几回来的？（往往要算计一下公农历的转换）”或者“啥时候走啊？（此时回答农历即可）”这样的关心话语。最后若是问无可问了，就可以用答案仍然显而易见的“上去啊（去前面拜年）？”来结束这场热络的交流了。 等双方互相告别之后，仍然不知道对方姓甚名谁的人们就可以询问同行的伙伴了。一般能得到“这是谁谁谁他二舅/叔/大爷/姑父”这样的回复，至于这“谁谁谁”到底是谁，碍于面子，就不好往下问了。 进了要磕头的屋门，便要接受主人们的热情招待。老人们这时候要赶紧离开炉子端上茶倒上水，顺便往盘子里倒点瓜子花生，享受几句“身体真是壮实”或者“老了真享福”这样的赞美。若主人家里有正在上学的孩子，那墙上必定要努力贴上几张显眼的奖状。感谢这两年学校的体贴，快要过年，甭管学习孬好，孩子们总能拿上一两张关系着这年是否好过的大红纸。 坐下后宾主通常会拉下家常，讲些村里的八卦，互相吹捧几句，磕两粒瓜子，抿一口茶水，就得告辞去前往下一家了。路上少不了要对上一家的情况进行一下总结并对下一家的拜访做一下展望。 路上可能还会碰到大妈大婶们聚在一块拉呱（聊天），这时候若是队伍不大且还有年轻人的存在，就会有奇妙的化学反应发生。先是其中一位大妈以“哎吆，这不是XX诶！”打头阵，接着女士们便纷纷嚼出“长得真样发（帅）”、“长得真是高”或者“这孩子有料”等等精彩的恭维。等到年轻人讪讪而过还不罢休，还要加大马力，以更高的分贝探讨着主人公的前世今生和家庭背景，直到逃离视线才肯继续下一场的甜言蜜语。 到了中午，整个村就要开始弥漫着酒气和肉味了。长辈们聚在一块无非是抽烟喝酒吹牛皮，小孩子们碰到一起就要来回打闹了。红包在这里的农村是不太常有的，一是人情往来过于繁琐，索性不给了事，二是孩子们往往群啸而来，也不好遍地开花。既然压岁钱不怎么有，那也就只能争点糖果和鸡爪了。 所以哭声笑声吆喝声往往与中南海的秘史旧闻们掺和在一块，跟桌上的酒菜散发着足足的烟火气，以至于我们新的一年，总在满足与喜剧中开启。","link":"/2019/02/18/新春拜年故事/"},{"title":"李国情北漂记","text":"本文写于2017年中，正值全国高考，广东卷的题目乃是写出中国特色，要求使用高铁、支付宝、共享单车等词，于是就写了一篇自认为切题的作文。 庆丰爷还在的时候，也是“情怀”逐渐被用烂的时候。李国情算是个文青，比较讲究真情怀，看不惯这世上的无病呻吟和虚情假意。于是在看到新世相发布的那个“逃离北上广”后的那夜凌晨，他坐上了成都开往北京的和谐号，成了一个北漂，带了一个钱包，舍了万贯家财。 北京的吃食乏善可陈，在吃惯了盐帮菜的国情眼里，就连便宜坊的烤鸭都看起来像是个俗不可耐的样子货。好在北漂是没有资格去抱怨这座城市的，他痛快的接受了这个无伤大雅的现实，钻进了唐家岭的地下室。 从五环坐车到天安门，又从天安门跑去了八达岭，课本上说不到长城非好汉，李国情想去当一回好汉。可他没想到北京很大，大概有半个河北那么大。还没过刘家沟，天就黑了。他叹了句“乘兴而来，兴尽而返”，这才满意地回了自己的居所。 李国情会点川剧，在成都算是个小有名气的票友。既然净身来到北京，自然要找点活干。他去了一家接待外国友人的酒店，老板说川剧京剧都是剧，反正那些洋鬼子总归是要奉承点中国文化博大精深的，你在那唱个十八摸，都有竖大拇指的。所以李国情就留在了酒店，成了半个老艺术家。 可能是看艺术家不怎么懂英语的缘故，洋鬼子比较喜欢找李国情聊天，跟他讲北京的雾霾多么多么的严重，零八年奥运会戴口罩来的时候受够了白眼，现在pm2.5的概念火了之后才敢重新戴上。又讲你们中国人啊除了要面子其他都好，在微博上说句爱中国就能涨好几千个粉，在外头丢个书包都能马上被警察找回来，放在加州那边那伙白眼狼真是连管都不管。 大概洋鬼子太享受作为大V的感觉了，连续拍了好几个“老外中国夜市寻小吃”的视频放到了B站上，结果给吃坏了肚子进了医院。不过出来的时候还是念叨着中国的好，用结结巴巴的普通话说要是放在美国住会院就要倾家荡产了，这让来探望他的李国情很是感动。 李国情来的时候是骑着单车来的，来之前他在停车区找了好一会才找到了这辆只是前胎没气的小黄，来的时候他路过一个公园，大妈们正在跟一伙年轻人争一个篮球场，小伙子们浑身的腱子肉，在气势汹汹军纪严明的大妈们面前却仍是瑟瑟发抖，让李国情暗骂了句没骨气。 出了院的洋鬼子和李国情成了好朋友，逐渐变得世俗的两个人也合伙搞起了文化创业。借着一带一路的东风搞了个美丽乡村的评选，引来了不少地方政府的追捧。两个人越搞越大，竟然成了气候。最美乡村的名头最后落在了河北一个刚盖起来的古镇头上，颁奖那天俩人还办了个典礼，从动物园租了不少大熊猫过来当吉祥物，外国人看了都夸好。 发了财的哥俩并没有享受太久的好日子，来自台湾的电信诈骗犯并没有被逮捕干净。正好单纯的左派洋鬼子也信了来自竞选失败的希拉里的鬼话，硬生生被骗走了亿万家产，还连累李国情也重新做了光蛋户。 好在兄弟同心，其利断金。现在兄弟俩二次创业办起了外国人代报案的业务，扫一扫二维码就能支付酬金，当真是方便又快捷。","link":"/2018/01/03/李国情北漂记/"},{"title":"搓澡志","text":"昨日两个舍友不知在哪来了兴致，吃完饭回来后讨论起了足疗。扯天谈地，竟勾起了我对澡堂子的回忆。 我出生在山东，小时候每到寒冬腊月，最头疼的便是如何能痛痛快快的洗个澡。那时家里用的是太阳能，在滴水成冰的日子里水管没有冻爆掉就已经谢天谢地了，自然不能指望着它会施舍点热水给我们。于是每隔段时间一家人就要去一次澡堂。 最早常去的一家在颜庄，如果看过我之前推送的朋友可能还记得这是以羊汤出名的镇子。所以在进澡堂前会先去羊汤馆切斤半羊肉，掰几瓣白蒜，倒一碗陈醋，来两盘饺子，吃饱喝足之后再去沐浴，颇有些断头饭的味道。事实证明，那时候的搓澡，对尚还细皮嫩肉的我来说不啻于一场酸爽的折磨。 澡堂不大，但还是分着男女室。在门口可以见到有不少大妈阿姨会领着自己的小儿子或者小孙子气昂昂地走进女室，一直有老爹在侧的我自然是无福享受这样的福利，所幸那时我还小，没什么想入非非的毛病。 澡堂很小，故没有澡池。右边立着一排花洒，左边矗着一间桑拿。光溜溜赤条条的汉子们得先去花洒旁冲一下身子，顺便把湿漉漉的白毛巾搭在肩膀上，再慢悠悠地走进桑拿室去蒸上几刻钟让自己变得铁汉柔情懵懂易搓，这才能踱进搓澡室接受师傅们的服务。 我怕闷热，老爹在桑拿室的时候又特喜欢往炭盆里泼水。因此我在桑拿室里往往撑不过一刻钟便要夺门而逃，以至于去年骑到杭州的时候热浪一袭来我的脑海里就浮现出几个腆着啤酒肚的大叔坐在桑拿室里指点江山挥斥方遒的可恶场景。 进了里屋，就要开始叫师傅了。男澡堂里自然没有女师傅，只有三十岁到六十岁不等的大叔与大爷（根据我的脑补女澡堂里的师傅应该都是老妈子）。师傅们穿着裤衩，大概是天天待在澡堂子的缘故，膀子都很是白生，肌肉也颇为鲜明，担得起浪里白条的称呼。招呼一声，便会过来往小床上铺一张塑料膜叫你趴上去。我那时候还是个胖小子，往上一趴，应该像是待宰的猪猡，我想那场面或许不会太过雅观。 师傅往手上套个搓套，就要开始下手了。搓澡分南北两派，虽然那个澡堂里的大叔大爷们多是从南边过来的，但一看就不太像是会讲究“四轻四重四周到”的扬州师傅，反而一个个都有着北方汉子的豪气，不搓的你长吁短叹就绝不放水，偏生那时候我沉默寡言，故而搓一次澡就如同打一场仗一样，双方都憋着一股儿气，非要争出个长短来。 搓澡其实是有高潮的，对我而言最舒服的时候莫过于搓完之后师傅往身上泼的那一瓢水。即冲污秽又洗精神，即便出了门还是能觉得出残留的清爽，早先所受的折磨，也就忽略不计了。 后来家里太阳能换了热水器，就很少去澡堂了。倒是每次自驾游的时候如果路过开封，就必要到当地的香山宾馆走上一遭。开封物价低廉，当时住上一晚花费不过几十块钱，还有温泉可泡，其住宿流程也很是新鲜。故不管是跟朋友还是亲戚出游的时候，只要经过河南，我们都会选在那里修整一晚。中考完后去了趟西安，又一次住那的时候还跟朋友很是中二的在澡池子里切磋泳技，至今想想仍是觉得好笑好玩。 再后来就进了高中，学校的生活条件颇像九十年代，而其学习安排又富含山东特色，所以每隔两周才能回家好好洗一次澡。期间要是觉得自己臭不可闻，就只能用冷水冲洗，故而每个宿舍都常备着十几个水桶。穷冬烈风之中，我们一个个都像是青年时期的毛泽东或者处于叛逆期的泰戈尔，站在阳台上拿着快要结冰的冷水往身上泼，颇有自残的架势。泼之前紧咬牙关，泼之后则是牙关紧咬，其要命的滋味只有不停用毛巾摩擦起热才能抹平。那时候的搓澡，倒更像是苦中求乐之举。 现在很少去澡堂也很少去搓澡了，只有在寒假回家的时候老爹要来个接风洗尘才会带着我去搓个澡。去的不再是澡堂而是洗浴中心，车一停就有个穿军大衣的老大爷敬一次礼仿佛是在迎接前来视察的首长。里头杵着的也不再是朴实卖力的大叔，搓澡师们更多的是在问要不要来个盐浴或者泰式推拿。至于顾客们，也早已从工薪阶级变成了金链子大哥或者啤酒肚老板为主。唯一有点乐子的也就是时常能见到个画着龙描着虎的社会人士光着身子打电话，让我能想入非非： 这大哥要是进了水，金链子会不会浮起来？","link":"/2018/01/03/搓澡志/"},{"title":"北城雾霾小史","text":"本文写于16年底或17年初，具体时间已记不太清。但倍感欣慰的是，今年山东的空气总算好了很多，从连续重度到了时常轻度，可以说是进步不小，值得庆祝。 今早阳光明媚，本想着应该是个大好天气结果朋友圈告诉我广州今日仍是重度污染。很多同学直呼呛得慌，街上还有不少人戴上了口罩，大有黑霾压城之感。远在南国有重重山峦阻隔的岭南，到底也还是躲不了这肆虐全国的霾灾。不知是幸运还是不幸，我始终对如此低浓度的ＰＭ２.５没有什么感觉，大概是从小习惯了的缘故吧。 我生在北方的一个小城，该城不大，是山东省最小的地级市，此城也不小，有全国最大的H型钢生产基地。托炼钢厂、冶金厂、化工厂、发电厂的福，即便在离工业区有几十公里远的小村子里的我也能喝最烈的水，吸最醇的霾。 不过在十几年前，这在我们那还叫雾而不是霾。那时候还没有ＰＭ２.５的概念，“起雾”仍然是大家的共识，虽然谁也说不清为什么干旱的日子越来越多，需要湿气才能成型的雾天也越来越多。冬日醒来拉开窗帘，一看外面黑布隆冬的夜色中带着涌动的白雾，我妈便去厨房拿一瓣蒜塞我嘴里——这是老一辈的传统，他们隐约知道这雾有毒，却并不清楚其中的原理，只能靠含着个辛辣的白蒜来充当一个无聊的心理安慰。 含蒜的时候我还在上小学，五点多就要从家里出发走向学校。此时天还未亮，大街上骑着摩托的农民工们从迷雾中鱼贯而出。大叔们奔向的是几十公里外的工地——工厂的铁饭碗只对城里的工人阶级开放，他们所能做的便是为这些工厂添砖加瓦。在这种天气下，人的视野只有五米，氤氲中蕴含着未知，故当一个个谈笑的初中生踩着单车突然出现在我面前又泯然于雾中时，一个渴望长大的我心情总会激动且不安，那时候我们那伙小学生所希望的便是多有一些这样有趣而又神秘的雾天，万万没想到的是，在十几年后的今天，我们又是如此的恐惧这样的霾天。 十年前，北方人以为他们所面临的最大环境问题还是沙尘暴。每到春季，总会有那么一两天反常的日子——天是暗红的，风起初也不大，但慢慢地就起来了，紧接着开始天地为之变色，门窗发出呜咽之声，学生们兴奋地趴在窗户边看着外面的奇景，西边有黄沙组成的风暴席卷而来，裹挟着还未腐烂的落叶与垃圾袋，每一次广告牌的掀起总能赢来一片喝彩，每一扇大门的轰然合闭都能引起一阵惊呼。风沙过后，便是一片狼藉与黄褐色的尘土。 十年前，大陆还没有雾霾这一说法。美国大使馆发布ＰＭ２.５指数被斥是在用阴谋抹黑中国，０８年北京奥运会外国运动员戴口罩的照片引起了官媒与网友们的口诛笔伐。直到１１年，官方才扭扭捏捏承认了雾霾的存在，在之后的一年又因为大使馆检测权的问题陷入了与美国的口水仗中。自此，雾霾跟春运一起成了每年冬天的全民话题。原北京市长在１４年放出治不好雾霾提头来见的豪言到如今也成了笑话。 十年前，大陆ＧＤＰ增速１３％，是今年指标的两倍。或在工地打工，或为工厂食堂提供蔬菜，又或者偷偷溜进钢厂偷一点废铁，那一年村里很多人日子一天比一天好过。工人大哥吃肉，农民兄弟喝汤，一个集团便是一座小城的经济命脉。在炼钢厂当一名事业单位的工人，是很多农村人可望而不可即的梦想。没有人谈什么环境保护——那些虚无缥缈的东西在想吃饱饭过好日子人的眼里就是在瞎扯，环保局的领导在老板和工人眼里都是来断财路的混蛋。 １３年的时候我看到了篇文章，讲的是北京顺义国际学校花了三千多万盖了两个充气膜体育馆——可以用来防霾。当时我和同学都觉得很不可思议，一点雾霾有什么大不了的呢？是啊，三千多万在我们那里可以干太多事情了，为什么跑到北京就成了两个大棚呢？防霾？这不是天天见的东西吗？对北方人来说又有什么可怕的呢？ 直到如今我还能回想起当时的诧异，那是一个北方小城的悲哀——那里的人们早已习惯了灰蒙蒙的天气，自觉地充当着吸霾的机器。戴口罩只会让人以为你是得了什么不得了的传染病，整个高中三年，我也只在某个灰蒙蒙的早晨看到我的英语老师戴着口罩跟她老公在校园里跑步。 老师的打扮还引来了学生们的侧目，要知道在那个全国各地的教育界一齐向衡水中学学习的日子里，我们学校的学生一天要跑三次操——有时候会是四次，每次在雾霾中操练的时候，都要扯着嗓子高喊“钢铁意志，众志成城”，这是我们区里新来的领导提出的口号，旨在振兴落魄的钢铁企业，可能学校的领导们也觉得要支持上司们一把，便决定让我们的呼喊冲破雾霾直抵不远处的区政府。于是，不管是寒冬还是烈日，也不管是大霾天还是小霾天，只要哨声一响，我们都要拿着小本子乖乖跑去楼下吸上几口颗粒物开始边跑边喊的健康运动。在那种情况下，戴口罩的人自然成为了异类。 从１１年到１４年，我好像并没有见过什么蓝天。在印象里，天永远是灰白的或者灰黑的，偶尔碰上天朗气清的好日子，老天会很给面子把亮度调高一点——从灰白调到淡白，这就是莫大的恩惠了。在空气最好的一个清晨，刚从早点摊买了杯豆浆的我正骑着车准备前往学校，在快到校门口时突然差点翻车，只因为看清了远方耸立的莲花山，在我的脑海里是没有能从学校看到几十公里之外山的可能性的，惊吓过度的我一度以为出现了海市蜃楼。 北方的冬天污染格外严重，我是半途进的城，所以一过十月肺和喉咙就开始难受的很，每天都是不停的咳嗽。为了防止流感传染，教室里的窗户一般在冬天是要开着透气的，处在窗户旁坐着的我自然是首当其冲，担当了班里的净化机功能。后来咳着咳着喉咙就麻木了，再后来碰到再霾的天气也激不起半点波澜。我想幸亏我不是条嗅觉灵敏的狗，要不然所受的摧残与折磨还要大上几分。 有年冬天我终于去了工业区，那里有家焦油厂，在晚上，方圆十里的范围内一片的黑灯瞎火。曾住在那的居民到底还是受不了恶臭的味道。以前如果你登上了我们学校前面那座并没有多少树的山，你会看到在不远处的工业区，浓浓的白烟从一个堪比高楼的烟囱里喷涌而出，直奔天际形成这个城市唯一壮观的景象。 现在工厂收敛了许多，只敢在下雨打雷的时候用大烟囱疯狂输出成吨的废气，每到那时工业区仿佛就像来了直升机在天空中嗡嗡的盘旋。盘旋过后便是酸雨——难以忍受的酸爽，淋在头上简直难受的要命。我们的教学楼在这摧残下每隔上几年也总要粉刷一次，来遮掩一下名不副实的沧桑。 很多时候，我是痛恨雾霾的，尤其当我第一次踏上北归的火车，看到外面的景色从青山绿水慢慢变成一片灰败时。但又有些时候，再次见到它的时候却又觉得非常的难受，不是因为它的沉重，而是因为它与这个城市的羁绊。 这个城市没有多少车，也早已禁止焚烧秸秆，但它的空气质量却几乎天天都是全国倒数，有时候甚至还会击败石家庄、太原、衡水等夺冠热门荣登榜首。这本不是一个山东最小地级市应得的待遇但这却恰恰就是一个指着工业存活的北方小城注定的宿命。 每次回到家乡，总会看到以前常去的店铺或者饭馆倒闭，也总会听说哪里的老总欠了多少债跑路去了，年底的时候区政府门口也总会堆着一群讨薪的农民工，政府大楼背后就是一座烂尾的高楼。这个小城指着一个大型的国企续命，但这个大型的国企却是污染的源头。如今经济下滑，在没有环保压力的时候尚且都要苟延残喘，又要去产能又要零污染还要保住就业的使命又怎能实现的了？更何况这还是一个体制僵化无数人混吃等死的企业，慢慢跟着这座小城腐朽似乎成了它所必须要面对的无趣现实。 与这相比，雾霾的确算不了什么。毕竟，在听说济南污染最重的几家工厂要搬来我们这后，因为没有活干而在街头打牌消磨度日的大叔们都咧开了嘴。有饭吃，谁还在乎点霾呢？ 这大概便是我们这个崛起帝国中一个小城躲不过的命运。","link":"/2018/01/03/北城雾霾小史/"}],"tags":[{"name":"经济史, 读书报告","slug":"经济史-读书报告","link":"/tags/经济史-读书报告/"},{"name":"Python","slug":"Python","link":"/tags/Python/"},{"name":"笔记","slug":"笔记","link":"/tags/笔记/"},{"name":"法学","slug":"法学","link":"/tags/法学/"},{"name":"互联网金融","slug":"互联网金融","link":"/tags/互联网金融/"},{"name":"杂文","slug":"杂文","link":"/tags/杂文/"},{"name":"生活","slug":"生活","link":"/tags/生活/"}],"categories":[{"name":"杂文","slug":"杂文","link":"/categories/杂文/"},{"name":"读书笔记","slug":"读书笔记","link":"/categories/读书笔记/"}]}